Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.AnalyticalPhysicalCheckDone Property
 Analytical / Physical Model Consistency check is complete.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AnalyticalPhysicalCheckDone { get; }
Public Shared ReadOnly Property AnalyticalPhysicalCheckDone As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AnalyticalPhysicalCheckDone {
	FailureDefinitionId^ get ();
}
static member AnalyticalPhysicalCheckDone : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace